In [4]:
import pandas as pd

In [17]:
a={'이름':['홍길동','사람1','사람2'],'나이':[20,30,25],
   '도시': ['서울','서울','대전']}

In [18]:
a

{'이름': ['홍길동', '사람1', '사람2'], '나이': [20, 30, 25], '도시': ['서울', '서울', '대전']}

In [19]:
df = pd.DataFrame(a)

In [20]:
df

    이름  나이  도시
0  홍길동  20  서울
1  사람1  30  서울
2  사람2  25  대전

In [21]:
df2=df.set_index(['이름'])
df2

     나이  도시
이름
홍길동  20  서울
사람1  30  서울
사람2  25  대전

In [22]:
df3=df2.set_index('도시')
df3

    나이
도시
서울  20
서울  30
대전  25

In [23]:
df2

     나이  도시
이름
홍길동  20  서울
사람1  30  서울
사람2  25  대전

In [24]:
df3=df2.reset_index()

In [27]:
df3

    이름  나이  도시
0  홍길동  20  서울
1  사람1  30  서울
2  사람2  25  대전

In [28]:
df3=df3.set_index(['도시'])
df3

     이름  나이
도시
서울  홍길동  20
서울  사람1  30
대전  사람2  25

In [29]:
df2

     나이  도시
이름
홍길동  20  서울
사람1  30  서울
사람2  25  대전

In [30]:
df2=df2.sort_index(ascending=True)
df2

     나이  도시
이름
사람1  30  서울
사람2  25  대전
홍길동  20  서울

In [31]:
df2=df2.sort_index(ascending=False)
df2

     나이  도시
이름
홍길동  20  서울
사람2  25  대전
사람1  30  서울

In [32]:
df2 = df2.sort_values(by='나이',ascending=False)
df2

     나이  도시
이름
사람1  30  서울
사람2  25  대전
홍길동  20  서울

In [33]:
df2=df2.T
df2

이름 사람1 사람2 홍길동
나이  30  25  20
도시  서울  대전  서울

In [34]:
df2=df2.T
df2

     나이  도시
이름
사람1  30  서울
사람2  25  대전
홍길동  20  서울

In [35]:
df2['나이대']=['30대','20대','20대']
df2

     나이  도시  나이대
이름
사람1  30  서울  30대
사람2  25  대전  20대
홍길동  20  서울  20대

In [36]:
df2=df2.reset_index()
df2

    이름  나이  도시  나이대
0  사람1  30  서울  30대
1  사람2  25  대전  20대
2  홍길동  20  서울  20대

In [37]:
b = {'20대':2, '30대':3}

In [38]:
df2['age_key']=df2['나이대'].map(b)
df2

    이름  나이  도시  나이대  age_key
0  사람1  30  서울  30대        3
1  사람2  25  대전  20대        2
2  홍길동  20  서울  20대        2

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   이름       3 non-null      object
 1   나이       3 non-null      object
 2   도시       3 non-null      object
 3   나이대      3 non-null      object
 4   age_key  3 non-null      int64
dtypes: int64(1), object(4)
memory usage: 248.0+ bytes